// src/models/nakathData.js
import newImage from '../images/new.jpg';
import newImage1 from '../images/pu.webp';
import newImage2 from '../images/lipa.webp';
import newImage3 from '../images/ganu.png';
import newImage4 from '../images/hisa.jpg';
import newImage5 from '../images/rak.jpg';

const nakathTimes2025 = [
    {
      id: 2,
      name: "පුණ්‍ය කාලය",
      date: "2025-04-13",
      time: "20:57",
      timestamp: new Date("2025-04-13T20:57:00").getTime(),
      description: "අප්‍රේල් මස 13 වන ඉරිදා අපරභාග 08.57 සිට පසු දින එනම් 14 වෙනි සදුදා පූර්වභාග 09.45 දක්වා පුණ්‍ය කාලය බැවින් අප්‍රේල් මස 13 වෙනි ඉරිදා අපරභාග 08.57ට පළමුව ආහාර පාන ගෙන සියලු වැඩ අත්හැර ආගමික වතාවත් වල යෙදීමද,පුණ්‍ය කාලයේ අපර කොටස එනම් අප්‍රේල් මස 14 වෙනි සදුදා පූර්ව භාග 03.21 සිට 14 වෙනි සදුදා පූර්වභාග 09.45 දක්වා පහත දැක්වෙන අයුරින් ආහාර පිසීම ,වැඩ ඇල්ලීම,ගනු දෙනු කිරීම හා ආහාර අනුභවය ආදී නැකත් චාරිත්‍ර විධි ඉටු කිරීම මැනවි.",
      image: newImage1
    },
    {
      id: 1,
      name: "අලුත් අවුරුදු උදාව",
      date: "2025-04-14",
      time: "03:21",
      timestamp: new Date("2025-04-14T03:21:00").getTime(),
      description: "අප්‍රේල් මස 14 වන සදුදා දින පූර්වභාග 03.21ට සිංහල අලුත් අවුරුද්ද උදා වෙයි.",
      image: newImage
    },
    {
      id: 3,
      name: "ආහාර පිසීම",
      date: "2025-04-14",
      time: "04:04",
      timestamp: new Date("2025-04-14T04:04:00").getTime(),
      description: "අප්‍රේල් මස 14 වෙනි සදුදා පූර්වභාග 04.04 ට තඹ වර්ණ වස්ත්‍රාභරණයෙන් සැරසී දකුණු දිශාව බලා ලිප් බැද ගිනි මොළවා කිරි බතක්ද කැවිලි වර්ගයක්ද  දී කිරි සද විලද ද පිළියෙල කර ගැනීම මැනවි.",
      image: newImage2

      
    },

    {
      id: 4,
      name: "වැඩ ඇල්ලීම,ගනුදෙනු කිරීම හා ආහාර අනුභවය",
      date: "2025-04-14",
      time: "06:44",
      timestamp: new Date("2025-04-14T06:44:00").getTime(),
      description: "අප්‍රේල් මස 14 වෙනි සදුදා පූර්වභාග 06.44ට මුතු හා ශ්වේත වර්ණ වස්ත්‍රාභරණයෙන් සැරසී දකුණු දිශාව බලා සියලු වැඩ අල්ලා ගනුදෙනු කොට ආහාර අනුභව කිරීම මැනවි.",
      image: newImage3
    },
    {
      id: 5,
      name: "හිස තෙල් ගෑම",
      date: "2025-04-16",
      time: "09:04",
      timestamp: new Date("2025-04-16T09:04:00").getTime(),
      description: "අප්‍රේල් මස 16 වන බදාදා දින පූර්වභාග 09.04ට කොළ පැහැති වස්ත්‍රාභරණයෙන් සැරසී උතුරු දිශාව බලා හිසට කොහොඹ පත්ද,පයට කොළොන් පත්ද තබා කොහොඹපත් යුෂ මිශ්‍ර නානු හා තෙල් ගා ස්නානය කිරීම මැනවි.",
      image: newImage4
    },
    {
      id: 6,
      name: "රැකී රක්ෂා සදහා පිටත්වා යෑම",
      date: "2025-04-17",
      time: "09:03",
      timestamp: new Date("2025-04-17T09:03:00").getTime(),
      description: "අප්‍රේල් මස 17 වැනි බ්‍රහස්පතින්දා පූර්වභාග 09.03ට රන්වන් පැහැති වස්ත්‍රාභරණයෙන් සැරසී කිරිබතක් හා එළ කිරි මිශ්‍ර කැවිලි වර්ගයක් අනුභව කර උතුරු දිශාව බලා පිටත්වා යෑම මැනවි.",
      image: newImage5
    }
].sort((a, b) => a.timestamp - b.timestamp); // Sort by timestamp ascending

export default nakathTimes2025;
